clg0=["전체"]
clg1=["전체","국어국문학과","사학과","철학과","응용영어통번역학과","영어영문학과"]
clg2=["전체","법학부"]
clg3=["전체","국제통상·금융투자학과","국제통상·금융투자학과","경제학과","무역학과","정치외교학과","사회학과","미디어학과","행정학과"]
clg4=["전체","경영학부","회계·세무학과","경영학과"]
clg5=["전체","관광학부","Hospitality경영학부","Hospitality경영학부 호텔경영학과","문화관광산업학과","조리산업학과","Hospitality경영학부 컨벤션경영학과","외식경영학과","Hospitality경영학부 조리·서비스경영학과","관광학부 문화관광콘텐츠학과","관광학부 관광학과"]
clg6=["전체","생물학과","화학과","물리학과","수학과","정보디스플레이학과","지리학과"]
clg7=["전체","식품영양학과","의상학과","아동가족학과","주거환경학과"]
clg8=["전체","의학과","의예과"]
clg9=["전체","한의예과","한의학과"]
clg10=["전체","치의학과","치의예과"]
clg11=["전체","한약학과","약과학과","약학과"]
clg12=["전체","간호학과","간호학과(야)"]
clg13=["전체","작곡과","성악과","기악과"]
clg14=["전체","미술학부","미술학부 한국화","미술학부 회화","미술학부 조소"]
clg15=["전체","무용학부","무용학부 한국무용","무용학부 현대무용","무용학부 발레"]
clg16=["전체","자율전공학과"]
clg17=["전체","환경학및환경공학과","건축공학과","기계공학과","사회기반시스템공학과","화학공학과","건축학과","산업경영공학과","정보전자신소재공학과","원자력공학과"]
clg18=["전체","전자공학과","생체의공학과"]
clg19=["전체","소프트웨어융합학과","컴퓨터공학과"]
clg20=["전체","우주과학과","응용화학과","응용물리학과","응용수학과"]
clg21=["전체","식물·환경신소재공학과","원예생명공학과","식품생명공학과","한방생명공학과","유전생명공학과"]
clg22=["전체","글로벌한국학과","국제학과"]
clg23=["전체","글로벌커뮤니케이션학부","글로벌커뮤니케이션학부 영미어문","한국어학과","일본어학과","중국어학과","러시아어학과","스페인어학과","프랑스어학과","글로벌커뮤니케이션학부 영미문화"]
clg24=["전체","도예학과","Post Modern음학학과","연극영화학과","산업디자인학과","환경조경디자인학과","의류디자인학과","디지털콘텐츠학과","시각디자인학과"]
clg25=["전체","태권도학과","체육학과","스포츠의학과","스포츠지도학과","골프산업학과"]

clgs={"전체":clg0, "문과대학":clg1,
      "법과대학":clg2,
      "정경대학":clg3,
      "경영대학":clg4,
      "호텔관광대학":clg5,
      "이과대학":clg6,
      "생활과학대학":clg7,
      "의과대학":clg8,
      "한의과대학":clg9,
      "치과대학":clg10,
      "약학대학":clg11,
         "간호과학대학":clg12,
         "음악대학":clg13,
         "미술대학":clg14,
         "무용학부":clg15,
         "자율전공학과":clg16,
         "공과대학":clg17,
         "전자정보대학":clg18,
         "소프트웨어융합대학":clg19,
         "응용과학대학":clg20,
         "생명과학대학":clg21,
         "국제대학":clg22,
         "외국어대학":clg23,
         "예술디자인대학":clg24,
         "체육대학":clg25}